app/Controllers/Atividades.php

SELECT *
FROM `atividades`
WHERE `LoginId` = '1'
---
    public function getListar()
    {
        if (!session()->get('isLogado')) {
            return redirect()->to('/login');
        }

        $atividades_model = new AtividadesModel();

        $meuId = session()->get('idUsuario');

        $atividades = $atividades_model
                               ->where('LoginId', $meuId)
                               ->findAll();

INSERT INTO `atividades` (`Nome`, `Descricao`, `DataInicio`, `DataFim`, `LoginId`) VALUES ('Portugues', 'Redação', '2026-05-10T22:00', '2026-05-20T20:00', '1')
---
    public function postCadastrar(){
        $dados = $this->request
                        ->getVar();

        $dados['LoginId'] = session()->get('idUsuario');

        $atividades_model = new AtividadesModel();

        $atividades_model->insert($dados);

DELETE FROM `atividades`
WHERE `AtividadeId` = '3'
---
    public function getExcluir($AtividadeId)
    {

        $atividades_model = new AtividadesModel();

        $atividades_model
            ->where('AtividadeId', $AtividadeId)
            ->delete();

UPDATE `atividades` SET `AtividadeId` = '4', `Nome` = 'Portugues', `Descricao` = 'Redação', `DataInicio` = '2026-05-10 22:00:00', `DataFim` = '2026-05-20 20:00:00', `Status` = 'concluido'
WHERE `AtividadeId` = '4'
---
    public function postEditar() {
        $dados = $this->request
                        ->getVar();

        $atividades_model = new AtividadesModel();

        $atividades_model
            ->where('AtividadeId', $dados['AtividadeId'])
            ->set($dados)
            ->update();